use K_MyBase2
go
create view [Представление обственность]
as select  Номер_собственности [Код],
Название_собственности [Название],
Адрес_собственности [Адрес], 
Цена_собственности [Цена]
from Собственность
go
select * from [Представление обственность]
----------------------------2
go
CREATE VIEW [Количество_кредитов]
as select Кредиты.Название_кредита [Вид],
COUNT(*) [Количество_кредитов]
from Кредиты inner join Заключение_контракта 
on Кредиты.Название_кредита=Заключение_контракта.Вид_кредта
group by Кредиты.Название_кредита
go
select * from [Количество_кредитов]
----------------------------3
go 
create view [Малая собственность]
as select Номер_собственности [Код],
Цена_собственности [Цена]
FROM Собственность
where Название_собственности like N'%1%'
go
select * from [Малая собственность]
INSERT [Малая собственность] values(7, 30000)
update [Малая собственность] set Цена=Цена+20000 where Код=2
delete from [Малая собственность] where Код=7
----------------------------4
go 
create view [Средняя собственность]
as select Номер_собственности [Код],
Название_собственности [Название],
Цена_собственности [Цена]
FROM Собственность
where Название_собственности like N'%2%' with check option
go
select * from [Средняя собственность]
INSERT [Средняя собственность] values(9,N'офис', 30000)
update [Средняя собственность] set Цена=Цена+20000 where Код=2

----------------------------5
go 
create view [Представление фирмы]
as select TOP 10 Название_фирмы [Название],
 Контактное_лицо [Лицо]
FROM Фирмы
order by Название
go
select * from [Представление фирмы]
----------------------------6
go
ALTER VIEW [Количество_кредитов] WITH SCHEMABINDING
as select A.Название_кредита [Название],
COUNT(*) [Количество_кредитов]
from dbo.Кредиты A inner join dbo.Заключение_контракта B
on A.Название_кредита=B.Вид_кредта
group by A.Название_кредита
go
select * from [Количество_кредитов]